{"format": "graph-model", "generatedBy": "2.3.0", "convertedBy": "TensorFlow.js Converter v2.8.1", "signature": {"inputs": {"normalization_2_input:0": {"name": "normalization_2_input:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "27"}]}}}, "outputs": {"Identity:0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "1"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_2/normalization_2/Reshape", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "27"}]}}}}}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/normalization_2/truediv_recip", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "27"}]}}}}}, {"name": "unknown_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "27"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_3", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_4", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_5", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_6", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_7", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_8", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "normalization_2_input", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "27"}]}}}}, {"name": "StatefulPartitionedCall/sequential_2/normalization_2/sub", "op": "Sub", "input": ["normalization_2_input", "StatefulPartitionedCall/sequential_2/normalization_2/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/normalization_2/truediv", "op": "Mul", "input": ["StatefulPartitionedCall/sequential_2/normalization_2/sub", "ConstantFolding/StatefulPartitionedCall/sequential_2/normalization_2/truediv_recip"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_8/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/normalization_2/truediv", "unknown_1", "unknown_2"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_9/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_8/Relu", "unknown_3", "unknown_4"], "device": "/device:CPU:0", "attr": {"num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_10/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_9/Relu", "unknown_5", "unknown_6"], "device": "/device:CPU:0", "attr": {"transpose_b": {"b": false}, "T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_11/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_2/dense_10/Relu", "unknown_7", "unknown_8"], "device": "/device:CPU:0", "attr": {"T": {"type": "DT_FLOAT"}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "transpose_a": {"b": false}, "transpose_b": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_2/dense_11/Sigmoid", "op": "Sigmoid", "input": ["StatefulPartitionedCall/sequential_2/dense_11/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_2/dense_11/Sigmoid"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 440}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_2/normalization_2/Reshape", "shape": [1, 27], "dtype": "float32"}, {"name": "ConstantFolding/StatefulPartitionedCall/sequential_2/normalization_2/truediv_recip", "shape": [1, 27], "dtype": "float32"}, {"name": "unknown_1", "shape": [27, 128], "dtype": "float32"}, {"name": "unknown_2", "shape": [128], "dtype": "float32"}, {"name": "unknown_3", "shape": [128, 256], "dtype": "float32"}, {"name": "unknown_4", "shape": [256], "dtype": "float32"}, {"name": "unknown_5", "shape": [256, 32], "dtype": "float32"}, {"name": "unknown_6", "shape": [32], "dtype": "float32"}, {"name": "unknown_7", "shape": [32, 1], "dtype": "float32"}, {"name": "unknown_8", "shape": [1], "dtype": "float32"}]}]}